FVM/Fluid-Mixing/3D/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  6                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
	version		2.0;
	format		ascii;
	location	"system";
	class		dictionary;
	object		blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.0001;

vertices
(
    (0 0 0)
    (0.2 0 0)
    (0.2 0.4 0)
    (0 0.4 0)
    (0 0 6)
    (0.2 0 6)
    (0.2 0.4 6)
    (0 0.4 6)

	(0.2 0 0)
	(0.4 0 0)
	(0.4 0.4 0)
	(0.2 0.4 0)
	(0.2 0 6)
	(0.4 0 6)
	(0.4 0.4 6)
	(0.2 0.4 6)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (20 40 600) simpleGrading (1 1 1)
	hex (8 9 10 11 12 13 14 15) (20 40 600) simpleGrading (1 1 1)
);

boundary
(
    left
    {
        type wall;
        faces
        (
                (0 4 7 3)
        );
    }
    right
    {
        type wall;
        faces
        (
            (9 10 14 13)
        );
    }
	Inner1
	{
		type patch;
		faces
		(
			(1 2 6 5)
		);
	}
	Inner2
	{
		type patch;
		faces
		(
			(8 12 15 11)
		);
	}
    Outlet
    {
        type patch;
        faces
        (
            (0 3 2 1)
			(8 11 10 9)
        );
    }
    Inlet1
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }
	Inlet2
	{
		type patch;
		faces
		(
			(12 13 14 15)
		);
	}
    front
    {
        type patch;
        faces
        (
            (0 1 5 4)
			(8 9 13 12)
        );
    }
    back
    {
        type patch;
        faces
        (
            (3 7 6 2)
			(11 15 14 10)
        );
    }
);

mergePatchPairs
(
	(Inner1 Inner2)
);

// ************************************************************************* //
