FVM/Fluid-Mixing/3D/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
  left
  {
      type            zeroGradient;
  }
  right
  {
      type            zeroGradient;
  }
  Outlet
  {
      type            fixedValue;
      value           0;
  }
  Inlet1
  {
      type            zeroGradient;
  }
  Inlet2
  {
      type            zeroGradient;
  }
  front
  {
      type            zeroGradient;
  }

  back
  {
      type            zeroGradient;
  }

  defaultFaces
  {
      type            empty;
  }

}


// ************************************************************************* //
