FVM/Fluid-Mixing/3D/0/alpha.water.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alpha.water;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    Outlet
    {
        type            zeroGradient;
    }

    left
    {
        type            zeroGradient;
    }
    right
    {
        type            zeroGradient;
    }

    Inlet1
    {
        type            fixedValue;
        value           uniform 0;
    }

    Inlet2
    {
        type            fixedValue;
        value           uniform 1;
    }

    front
    {
        type            zeroGradient;
    }

    back
    {
        type            zeroGradient;
    }

    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
